; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-8-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p1-3 - location
	p1-5 - location
	p2-1 - location
	p4-1 - location
	p4-6 - location
	p5-0 - location
	p5-2 - location
	p6-1 - location
	p6-3 - location
	p7-2 - location
	p7-3 - location
	p7-4 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s5)
	(at driver3 s0)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s3)
	(empty truck7)
	(at truck8 s4)
	(empty truck8)
	(at package1 s4)
	(at package2 s2)
	(at package3 s4)
	(at package4 s0)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s6)
	(link s6 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s5)
	(link s5 s4)
	(link s5 s6)
	(link s6 s5)
	(link s6 s3)
	(link s3 s6)
	(link s7 s3)
	(link s3 s7)
	(link s7 s4)
	(link s4 s7)
	(link s7 s5)
	(link s5 s7)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s1)
	(at truck1 s5)
	(at truck2 s0)
	(at truck4 s1)
	(at truck5 s0)
	(at truck8 s1)
	(at package1 s6)
	(at package2 s6)
	(at package3 s6)
	(at package4 s0)
	))


)

; plan
1. (board-truck driver2 s5 truck3)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 11
2. (drive-truck driver2 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 1 of 11
3. (load-truck s4 package3 truck3)
   deleted: (at package3 s4)
   added: (in package3 truck3)
   goals met: 1 of 11
4. (load-truck s4 package1 truck3)
   deleted: (at package1 s4)
   added: (in package1 truck3)
   goals met: 1 of 11
5. (drive-truck driver2 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 1 of 11
6. (drive-truck driver2 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 1 of 11
7. (unload-truck s6 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s6)
   goals met: 2 of 11
8. (unload-truck s6 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s6)
   goals met: 3 of 11
9. (drive-truck driver2 s6 s3 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   goals met: 3 of 11
10. (drive-truck driver2 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 3 of 11
11. (board-truck driver3 s0 truck1)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 11
12. (drive-truck driver2 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 3 of 11
13. (disembark-truck driver2 s4 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 4 of 11
14. (board-truck driver2 s4 truck8)
   deleted: (at driver2 s4) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 3 of 11
15. (drive-truck driver2 s4 s1 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s1)
   goals met: 4 of 11
16. (drive-truck driver3 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 4 of 11
17. (disembark-truck driver3 s3 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 4 of 11
18. (disembark-truck driver2 s1 truck8)
   deleted: (driving driver2 truck8)
   added: (at driver2 s1) (empty truck8)
   goals met: 4 of 11
19. (board-truck driver2 s1 truck2)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 11
20. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 5 of 11
21. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 4 of 11
22. (load-truck s2 package2 truck2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 4 of 11
23. (drive-truck driver2 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 5 of 11
24. (drive-truck driver2 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 4 of 11
25. (drive-truck driver2 s5 s6 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   goals met: 4 of 11
26. (unload-truck s6 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s6)
   goals met: 5 of 11
27. (drive-truck driver2 s6 s5 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   goals met: 5 of 11
28. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 6 of 11
29. (board-truck driver3 s3 truck4)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 6 of 11
30. (drive-truck driver3 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 6 of 11
31. (drive-truck driver3 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 7 of 11
32. (disembark-truck driver3 s1 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 8 of 11
33. (walk driver3 s1 p1-3)
   deleted: (at driver3 s1)
   added: (at driver3 p1-3)
   goals met: 7 of 11
34. (walk driver3 p1-3 s3)
   deleted: (at driver3 p1-3)
   added: (at driver3 s3)
   goals met: 7 of 11
35. (board-truck driver3 s3 truck5)
   deleted: (at driver3 s3) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 7 of 11
36. (drive-truck driver3 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 8 of 11
37. (drive-truck driver3 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 7 of 11
38. (disembark-truck driver3 s1 truck5)
   deleted: (driving driver3 truck5)
   added: (at driver3 s1) (empty truck5)
   goals met: 8 of 11
39. (drive-truck driver2 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 7 of 11
40. (disembark-truck driver2 s4 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 8 of 11
41. (walk driver3 s1 p1-3)
   deleted: (at driver3 s1)
   added: (at driver3 p1-3)
   goals met: 7 of 11
42. (walk driver3 p1-3 s3)
   deleted: (at driver3 p1-3)
   added: (at driver3 s3)
   goals met: 7 of 11
43. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 6 of 11
44. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 6 of 11
45. (board-truck driver2 s1 truck5)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 6 of 11
46. (drive-truck driver2 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 7 of 11
47. (drive-truck driver2 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 6 of 11
48. (disembark-truck driver2 s4 truck5)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 7 of 11
49. (walk driver3 s3 p1-3)
   deleted: (at driver3 s3)
   added: (at driver3 p1-3)
   goals met: 7 of 11
50. (walk driver3 p1-3 s1)
   deleted: (at driver3 p1-3)
   added: (at driver3 s1)
   goals met: 8 of 11
51. (board-truck driver2 s4 truck5)
   deleted: (at driver2 s4) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 7 of 11
52. (drive-truck driver2 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 8 of 11
53. (walk driver3 s1 p4-1)
   deleted: (at driver3 s1)
   added: (at driver3 p4-1)
   goals met: 7 of 11
54. (walk driver3 p4-1 s4)
   deleted: (at driver3 p4-1)
   added: (at driver3 s4)
   goals met: 7 of 11
55. (board-truck driver3 s4 truck2)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 7 of 11
56. (drive-truck driver2 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 6 of 11
57. (disembark-truck driver2 s4 truck5)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 7 of 11
58. (drive-truck driver3 s4 s7 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s7)
   goals met: 7 of 11
59. (drive-truck driver3 s7 s5 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   goals met: 7 of 11
60. (board-truck driver2 s4 truck5)
   deleted: (at driver2 s4) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 6 of 11
61. (drive-truck driver2 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 7 of 11
62. (disembark-truck driver3 s5 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 7 of 11
63. (walk driver3 s5 p1-5)
   deleted: (at driver3 s5)
   added: (at driver3 p1-5)
   goals met: 7 of 11
64. (drive-truck driver2 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 6 of 11
65. (walk driver3 p1-5 s1)
   deleted: (at driver3 p1-5)
   added: (at driver3 s1)
   goals met: 7 of 11
66. (walk driver1 s0 p5-0)
   deleted: (at driver1 s0)
   added: (at driver1 p5-0)
   goals met: 7 of 11
67. (walk driver1 p5-0 s5)
   deleted: (at driver1 p5-0)
   added: (at driver1 s5)
   goals met: 7 of 11
68. (board-truck driver1 s5 truck2)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 11
69. (drive-truck driver1 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 8 of 11
70. (disembark-truck driver2 s3 truck5)
   deleted: (driving driver2 truck5)
   added: (at driver2 s3) (empty truck5)
   goals met: 8 of 11
71. (walk driver2 s3 p7-3)
   deleted: (at driver2 s3)
   added: (at driver2 p7-3)
   goals met: 8 of 11
72. (walk driver2 p7-3 s7)
   deleted: (at driver2 p7-3)
   added: (at driver2 s7)
   goals met: 8 of 11
73. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 7 of 11
74. (disembark-truck driver1 s3 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 7 of 11
75. (walk driver2 s7 p7-4)
   deleted: (at driver2 s7)
   added: (at driver2 p7-4)
   goals met: 7 of 11
76. (walk driver2 p7-4 s4)
   deleted: (at driver2 p7-4)
   added: (at driver2 s4)
   goals met: 8 of 11
77. (board-truck driver1 s3 truck5)
   deleted: (at driver1 s3) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 8 of 11
78. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 9 of 11
79. (walk driver3 s1 p1-3)
   deleted: (at driver3 s1)
   added: (at driver3 p1-3)
   goals met: 8 of 11
80. (walk driver3 p1-3 s3)
   deleted: (at driver3 p1-3)
   added: (at driver3 s3)
   goals met: 8 of 11
81. (board-truck driver3 s3 truck1)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 11
82. (drive-truck driver3 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 9 of 11
83. (disembark-truck driver3 s5 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s5) (empty truck1)
   goals met: 9 of 11
84. (walk driver3 s5 p1-5)
   deleted: (at driver3 s5)
   added: (at driver3 p1-5)
   goals met: 9 of 11
85. (walk driver3 p1-5 s1)
   deleted: (at driver3 p1-5)
   added: (at driver3 s1)
   goals met: 10 of 11
86. (walk driver3 s1 p1-3)
   deleted: (at driver3 s1)
   added: (at driver3 p1-3)
   goals met: 9 of 11
87. (walk driver3 p1-3 s3)
   deleted: (at driver3 p1-3)
   added: (at driver3 s3)
   goals met: 9 of 11
88. (board-truck driver3 s3 truck2)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 9 of 11
89. (drive-truck driver3 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 10 of 11
90. (disembark-truck driver1 s0 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s0) (empty truck5)
   goals met: 10 of 11
91. (walk driver1 s0 p5-0)
   deleted: (at driver1 s0)
   added: (at driver1 p5-0)
   goals met: 10 of 11
92. (walk driver1 p5-0 s5)
   deleted: (at driver1 p5-0)
   added: (at driver1 s5)
   goals met: 10 of 11
93. (walk driver1 s5 p1-5)
   deleted: (at driver1 s5)
   added: (at driver1 p1-5)
   goals met: 10 of 11
94. (walk driver1 p1-5 s1)
   deleted: (at driver1 p1-5)
   added: (at driver1 s1)
   goals met: 10 of 11
95. (drive-truck driver3 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 9 of 11
96. (disembark-truck driver3 s1 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 10 of 11
97. (board-truck driver1 s1 truck2)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 10 of 11
98. (drive-truck driver1 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 11 of 11
